InformationRegisters/ЛБ_НастройкаДопустимыхВидовОгранки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаДопустимыхВидовОгранки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаВеса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СпособыРасчетаВесаДрагоценныхКамней</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОграниченныйСписокВидовОгранки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаДопустимыхКачествОгранки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаДопустимыхКачествОгранки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КачествоОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КачествоОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЛБ_ФормаВыбораХарактеристикВставки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Вставка") Тогда
		Вставка = Параметры.Вставка;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Вставка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВыборПоВставке();   
	
	Если Параметры.Свойство("АдресХранилища") Тогда 
		ТаблицаВставок = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
		ЗаполнитьПоДокументу(ТаблицаВставок);
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоДокументу(ТаблицаВставок)    
	ТабФО = ТаблицаВставок.Скопировать();  
	ТабФО.Свернуть("ФормаОгранки"); 
	ТабВО = ТаблицаВставок.Скопировать(); 
	ТабВО.Свернуть("ФормаОгранки, ВидОгранки");
	ТабКО = ТаблицаВставок.Скопировать(); 
	ТабКО.Свернуть("ФормаОгранки, ВидОгранки, КачествоОгранки"); 
 
	Для каждого СтрС Из ТабФО Цикл 
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ФормаОгранки", СтрС.ФормаОгранки);
		
		НайдСтроки = ФормыОгранки.НайтиСтроки(ПараметрыПоиска);
		Если НайдСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаФО = НайдСтроки.Получить(0);
		СтрокаФО.Вкл = Истина;   
		
		Отбор = Новый Структура;
		Отбор.Вставить("ФормаОгранки", СтрС.ФормаОгранки);
		
		СтрокиВ = ТабВО.НайтиСтроки(Отбор);     
		Для каждого СтрВ Из СтрокиВ Цикл   
			Отбор.Вставить("ВидОгранки", СтрВ.ВидОгранки); 
			Строки = ВидыОгранки.НайтиСтроки(Отбор);
			Для каждого Стр Из Строки Цикл
				Стр.Вкл = Истина;
			КонецЦикла; 
			
			СтрокиК = ТабКО.НайтиСтроки(Отбор);  
			Для каждого СтрК из СтрокиК Цикл 
				Отбор.Вставить("КачествоОгранки", СтрК.КачествоОгранки); 
				Строки = КачествоОгранки.НайтиСтроки(Отбор);
				Для каждого Стр Из Строки Цикл
					Стр.Вкл = Истина;
				КонецЦикла; 
			Конеццикла;	   
			Отбор.Удалить("КачествоОгранки");
		Конеццикла; 
	Конеццикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыборПоВставке()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Вставка); 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ФормыОгранки.Ссылка КАК ФормаОгранки
	               |ИЗ
	               |	Справочник.ЛБ_ФормыОгранки КАК ЛБ_ФормыОгранки
	               |ГДЕ
	               |	ЛБ_ФормыОгранки.Владелец = &Владелец
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаФО = Запрос.Выполнить().Выгрузить();  
	ФормыОгранки.Загрузить(ТаблицаФО);
	 
	Запрос.УстановитьПараметр("ВидКамня", Вставка); 
	Запрос.УстановитьПараметр("ФормыОгранки", ТаблицаФО.ВыгрузитьКолонку("ФормаОгранки"));
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_НастройкаДопустимыхВидовОгранки.ВидОгранки КАК ВидОгранки,
                   |	ЛБ_НастройкаДопустимыхВидовОгранки.ФормаОгранки КАК ФормаОгранки
                   |ИЗ
                   |	РегистрСведений.ЛБ_НастройкаДопустимыхВидовОгранки КАК ЛБ_НастройкаДопустимыхВидовОгранки
                   |ГДЕ
                   |	ЛБ_НастройкаДопустимыхВидовОгранки.ВидКамня = &ВидКамня
                   |	И ЛБ_НастройкаДопустимыхВидовОгранки.ФормаОгранки В(&ФормыОгранки)
                   |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаВО = Запрос.Выполнить().Выгрузить(); 
	ТаблицаВО.Свернуть("ФормаОгранки, ВидОгранки");
	Если НЕ ТаблицаВО.Количество() = 0  Тогда   
		ВидыОгранки.Загрузить(ТаблицаВО);
	Иначе	
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ВидыОгранки.Ссылка КАК ВидОгранки
		               |ИЗ
		               |	Справочник.ЛБ_ВидыОгранки КАК ЛБ_ВидыОгранки
		               |ГДЕ
		               |	ЛБ_ВидыОгранки.ПометкаУдаления = ЛОЖЬ
		               |АВТОУПОРЯДОЧИВАНИЕ";  
		ТаблицаВО = Запрос.Выполнить().Выгрузить();
		Для каждого стр из ТаблицаВО Цикл 
			Для каждого Стр1 Из ТаблицаФО цикл  
				СтрВО = ВидыОгранки.Добавить();
		        СтрВО.ФормаОгранки = стр1.ФормаОгранки; 
				СтрВО.ВидОгранки = стр.ВидОгранки;  
			КонецЦикла;	
	    Конеццикла; 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидКамня", Вставка); 
	СписокФО = ТаблицаФО.ВыгрузитьКолонку("ФормаОгранки");
	СписокФО.Добавить(Справочники.ЛБ_ФормыОгранки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ФормыОгранки", СписокФО); 
	СписокВО = ТаблицаВО.ВыгрузитьКолонку("ВидОгранки");
	СписокВО.Добавить(Справочники.ЛБ_ВидыОгранки.ПустаяСсылка());
    Запрос.УстановитьПараметр("ВидыОгранки", СписокВО);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_НастройкаДопустимыхКачествОгранки.КачествоОгранки КАК КачествоОгранки,
                   |	ЛБ_НастройкаДопустимыхКачествОгранки.ФормаОгранки КАК ФормаОгранки,
                   |	ЛБ_НастройкаДопустимыхКачествОгранки.ВидОгранки КАК ВидОгранки
                   |ИЗ
                   |	РегистрСведений.ЛБ_НастройкаДопустимыхКачествОгранки КАК ЛБ_НастройкаДопустимыхКачествОгранки
                   |ГДЕ
                   |	ЛБ_НастройкаДопустимыхКачествОгранки.ВидКамня = &ВидКамня
                   |	И ЛБ_НастройкаДопустимыхКачествОгранки.ФормаОгранки В(&ФормыОгранки)
                   |	И ЛБ_НастройкаДопустимыхКачествОгранки.ВидОгранки В(&ВидыОгранки)
                   |АВТОУПОРЯДОЧИВАНИЕ"; 
	 ТаблицаКО = Запрос.Выполнить().Выгрузить();
	 ТаблицаКО.Свернуть("ФормаОгранки, ВидОгранки, КачествоОгранки");

	 КачествоОгранки.Загрузить(ТаблицаКО);
КонецПроцедуры	

&НаСервере
Функция ПоместитьВХранилище() 
	ТаблицаВставок = Новый ТаблицаЗначений;  
	ТаблицаВставок.Колонки.Добавить("Вставка");
	ТаблицаВставок.Колонки.Добавить("ФормаОгранки");
	ТаблицаВставок.Колонки.Добавить("ВидОгранки");
	ТаблицаВставок.Колонки.Добавить("КачествоОгранки");
	НоваяСтр = ТаблицаВставок.Добавить();
	НоваяСтр.Вставка = Вставка;
    Ном1 = 0;
	Для каждого Стр1 Из ФормыОгранки Цикл  
		Если НЕ Стр1.Вкл тогда
			Продолжить;
		КонецЕсли; 
		
		Если НЕ Ном1 = 0 Тогда
			НоваяСтр = ТаблицаВставок.Добавить();
			НоваяСтр.Вставка = Вставка;                
		КонецЕсли;	
		НоваяСтр.ФормаОгранки = Стр1.ФормаОгранки; 
		Ном1 = Ном1 + 1;
		
		Ном2 = 0;		
		Отбор = Новый Структура;
		Отбор.Вставить("ФормаОгранки", Стр1.ФормаОгранки); 
		Для каждого Стр2 Из ВидыОгранки.НайтиСтроки(Отбор) Цикл 
			Если НЕ Стр2.Вкл тогда
				Продолжить;
			КонецЕсли;
			Если НЕ Ном2 = 0 Тогда
				НоваяСтр = ТаблицаВставок.Добавить();
				НоваяСтр.Вставка = Вставка;
				НоваяСтр.ФормаОгранки = Стр1.ФормаОгранки;                 
			КонецЕсли;	
			НоваяСтр.ВидОгранки = Стр2.ВидОгранки; 
			Ном2 = Ном2 + 1;
			
			Ном3 = 0;
			Отбор.Вставить("ВидОгранки", Стр2.ВидОгранки);
			Для каждого Стр3 Из КачествоОгранки.НайтиСтроки(Отбор) Цикл 
				Если НЕ Стр3.Вкл тогда
					Продолжить;
				КонецЕсли;
                Если НЕ Ном3 = 0 Тогда
					НоваяСтр = ТаблицаВставок.Добавить();
					НоваяСтр.Вставка = Вставка;
					НоваяСтр.ФормаОгранки = Стр1.ФормаОгранки;
					НоваяСтр.ВидОгранки = Стр2.ВидОгранки;
				КонецЕсли;	

				НоваяСтр.КачествоОгранки = Стр3.КачествоОгранки; 
				Ном3 = Ном3 + 1;
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаВставок, ЭтаФорма.УникальныйИдентификатор);
КонецФункции	
	
&НаКлиенте
Процедура Выбрать(Команда)  
	СтруктураВозврата = новый структура;
	СтруктураВозврата.Вставить("Вставка", Вставка);
	СтруктураВозврата.Вставить("АдресХранилища", ПоместитьВХранилище());
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ФормыОгранкиПриАктивизацииСтроки(Элемент)     
	Текстрока = Элементы.ФормыОгранки.ТекущиеДанные;  
	Если НЕ Текстрока = неопределено Тогда
	    Элементы.ВидыОгранки.ОтборСтрок = Новый ФиксированнаяСтруктура("ФормаОгранки", Текстрока.ФормаОгранки);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВидыОгранкиПриАктивизацииСтроки(Элемент)
	Текстрока = Элементы.ВидыОгранки.ТекущиеДанные; 
	Если НЕ Текстрока = неопределено Тогда
	    Элементы.КачествоОгранки.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидОгранки, ФормаОгранки", Текстрока.ВидОгранки, Текстрока.ФормаОгранки); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ФормыОгранкиВклПриИзменении(Элемент)
	ТекСтрока = Элементы.ФормыОгранки.ТекущиеДанные;
	Отбор = Новый Структура;                        
	Отбор.Вставить("ФормаОгранки", ТекСтрока.ФормаОгранки);
	
	Строки = ВидыОгранки.НайтиСтроки(Отбор);
	Для каждого стр Из строки Цикл     
		Стр.Вкл = ТекСтрока.Вкл;
	Конеццикла;	  
	
	Строки = КачествоОгранки.НайтиСтроки(Отбор);
	Для каждого стр Из строки Цикл     
		Стр.Вкл = ТекСтрока.Вкл;
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВидыОгранкиВклПриИзменении(Элемент)
	ТекСтрока = Элементы.ВидыОгранки.ТекущиеДанные;
	Отбор = Новый Структура;                        
	Отбор.Вставить("ВидОгранки", ТекСтрока.ВидОгранки);
	
	Строки = КачествоОгранки.НайтиСтроки(Отбор);
	Для каждого стр Из строки Цикл     
		Стр.Вкл = ТекСтрока.Вкл;
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьФлажкиФО(Команда)
	Для сч = 0 По ФормыОгранки.Количество()-1 Цикл 
		ФормыОгранки[сч].Вкл = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьФлажкиФО(Команда)
	Для сч = 0 По ФормыОгранки.Количество()-1 Цикл 
		ФормыОгранки[сч].Вкл = Ложь;
	КонецЦикла;	   
	
	Для сч = 0 По ВидыОгранки.Количество()-1 Цикл 
		ВидыОгранки[сч].Вкл = Ложь;
	КонецЦикла;	
	
	Для сч = 0 По КачествоОгранки.Количество()-1 Цикл 
		КачествоОгранки[сч].Вкл = Ложь;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьФлажкиВО(Команда)
	Для сч = 0 По ВидыОгранки.Количество()-1 Цикл 
		ВидыОгранки[сч].Вкл = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьФлажкиВО(Команда)
	Для сч = 0 По ВидыОгранки.Количество()-1 Цикл 
		ВидыОгранки[сч].Вкл = Ложь;
	КонецЦикла;	 
	
	ТекСтрока = Элементы.ФормыОгранки.ТекущиеДанные;
	Отбор = Новый Структура;                        
	Отбор.Вставить("ФормаОгранки", ТекСтрока.ФормаОгранки);
	
	Строки = КачествоОгранки.НайтиСтроки(Отбор);
	Для каждого стр Из строки Цикл     
		Стр.Вкл = Ложь;
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьФлажкиКО(Команда)
	Для сч = 0 По КачествоОгранки.Количество()-1 Цикл 
		КачествоОгранки[сч].Вкл = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьФлажкиКО(Команда)
	Для сч = 0 По КачествоОгранки.Количество()-1 Цикл 
		КачествоОгранки[сч].Вкл = Ложь;
	КонецЦикла;	
КонецПроцедуры
